spiricom/stm32f4/drumbox_405_firstIC/Src/waveplayer.c
	// Initialize cycle.
	// initialize audio 
	tCycleInit(&sin1, SAMPLE_RATE, sinewave, SINE_TABLE_SIZE);
	tNoiseInit(&noise1, SAMPLE_RATE, &randomNumber, NoiseTypeWhite);
	tRampInit(&rampFeedback, SAMPLE_RATE, 10.0f, 1);
	tRampInit(&rampSineFreq, SAMPLE_RATE, 20.0f, 1);
	tRampInit(&rampDelayFreq, SAMPLE_RATE, 20.0f, 1);
	tRampInit(&rampKSGain, SAMPLE_RATE, 5.0f, 1);
	tHighpassInit(&highpass1, SAMPLE_RATE, 20.0f);
	tHighpassInit(&highpass2, SAMPLE_RATE, 45.0f);
	tEnvelopeFollowerInit(&envFollowNoise, 0.001f, 0.0f);
	tEnvelopeFollowerInit(&envFollowSine, 0.001f, 0.0f);
	tEnvelopeFollowerInit(&envFollowTrigOut, 0.001f, 0.97f);
	tDelayInit(&delay1,delayBuffer1);
	tSVFInit(&svf1,SAMPLE_RATE,SVFTypeBandpass, 2000, 1.0f);
	
	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_RESET); 
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET); // ADC CS pin goes high to make sure it's not selected
	HAL_Delay(100);
	
#if I2C1_TEST_ENABLED
	while(1) {
		DMA1_externalDACSend();
		HAL_Delay(100);
	}
#endif

#if TEST_LED_ENABLED
	int x,y;
	int timer = 0;
	int toggle = 0;
	while(1) {
		
		setXYLED(x,y);
		
		
		if (timer++ > 100000) {
			toggle = !toggle;
			setTrigOut(toggle);
			x += 2; y += 3;
			timer = 0;
		}
		if (x >= 8) x = 0;
		if (y >= 8) y = 0;
			
	}
#endif
	//DMA1_externalDACInit();
	//HAL_Delay(100);
	//now to send all the necessary messages to the codec
	AudioCodec_init();
	HAL_Delay(100);
	//HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_RESET); 
	
	
	//MX_SPI1_Init();
	//start_Other_IC_Communication();
	
	// set up the I2S driver to send audio data to the codec (and retrieve input as well)	
	//HAL_I2SEx_TransmitReceive_DMA(&hi2s3, (uint16_t*)&audioOutBuffer[0], (uint16_t*)&audioInBuffer[0], AUDIO_BUFFER_SIZE);
	HAL_I2SEx_TransmitReceive_DMA(&hi2s3, (uint16_t *)&audioOutBuffer[0], (uint16_t *)&audioInBuffer[0], AUDIO_BUFFER_SIZE);
  
	// SPI1 Other Chip communication Initial Call
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_0, GPIO_PIN_RESET); // Other IC CS pin goes high to allow conversion start
	HAL_Delay(1); 
	//HAL_SPI_TransmitReceive_DMA(&hspi1, (uint8_t *)IC_tx, (uint8_t *)IC_rx, IC_BUFFER_SIZE); // removed (uint8_t *) casts before IC_tx and IC_rx
	
	whichSPI2 = 0;
	// SPI2 LED Initial Call
	
	setXYLED(3,3);
	
	
/*
  while(1)
	{
		//if(HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_1) == GPIO_PIN_SET)
		//{
			//getXY_Touchpad();
			//Write7SegWave((myTouchpad[0] / 4));
		  spi1tx = HAL_DMA_GetState(&hdma_spi1_tx);
		  mess = spi1tx;
		  spi1rx = HAL_DMA_GetState(&hdma_spi1_rx);
		  mess = spi1rx;
		
		
		//}
	}
	*/
	/*
	while(1)
	{
		if(HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_1) == GPIO_PIN_SET)
		{
			getXY_Touchpad();
			//Write7SegWave((myTouchpad[0] / 4));
			
		}
	}
	*/
	//HAL_SPI_TransmitReceive_DMA(&hspi1, (uint8_t *)IC_tx, (uint8_t *)IC_rx, IC_BUFFER_SIZE);
}

uint16_t dacCount1 = 0;
uint16_t dacCount2 = 0;
uint16_t dacCount3 = 0;
uint16_t dacCount4 = 0;

float FM_in; 
int count = 0;
void audioTick(uint16_t buffer_offset)
{
	//communicateWithOtherIC();
	
	uint16_t i = 0;
	int16_t current_sample = 0;  

	if (HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_1)) {
		getXY_Touchpad();
	}
	
	newDelay = interpolateDelayControl((4096 - (myTouchpad[1] * 16)));
	rampDelayFreq.setDest(&rampDelayFreq,newDelay);
	
	newFreq = ((mtof1[myTouchpad[0] * 16]) * 0.2f);
	rampSineFreq.setDest(&rampSineFreq,newFreq);

	XYLED[0] = 7 - (uint8_t)(myTouchpad[0] * INV_TWO_TO_5);
	XYLED[1] = 7 - (uint8_t)(myTouchpad[1] * INV_TWO_TO_5);
	
	if (XY_Tx_Ready)
	{
		XY_Tx_Ready = 0;
		setXYLED(XYLED[0],XYLED[1]);
	}
	

	for (i = 0; i < (HALF_BUFFER_SIZE); i++)
	{
		if ((i & 1) == 0) {
			current_sample = (int16_t)(audioProcess((float) (audioInBuffer[buffer_offset + i] * INV_TWO_TO_15)) * TWO_TO_15);
		} else {
			FM_in = (float)(audioInBuffer[buffer_offset + i] * INV_TWO_TO_15);
		}
		audioOutBuffer[buffer_offset + i] = current_sample;
	}
	
	if (ADC_Tx_Ready) 
	{
		ADC_Tx_Ready = 0;
		readExternalADC();
	}
	
}

#define DAC_OUT 1
#define TRIG_OUT 0
uint16_t newcount = 0;
float sinefreq, delayfreq;
typedef enum BOOL {
	FALSE = 0,
	TRUE
} BOOL;

#define NUM_SAMPS_BETWEEN_TRIG 2048
uint32_t sampSinceTrig = 0;
uint16_t prevValue = 0;

//uint16_t dacVref =  0x90;

float noiseToEnv, sineToEnv, envSine1;
uint16_t envIntNoise, envIntSine;
uint16_t envNoise1;
float sineEnv, noiseEnv;

float audioProcess(float audioIn) {
	
	
	// UPDATE NOISE FILTER Q and FREQ
	float Q = 14.9f * (ADC_values[ControlParameterNoiseWidth] * INV_TWO_TO_12) + 0.1f;
	noiseFilterGain = 0.1f*(1.0f - (Q/15.0f))+0.025f;
	svf1.setQ(&svf1, Q);
	svf1.setFreq(&svf1, ADC_values[ControlParameterNoiseCutoff]); 
	
	// SET NOISE DECAY COEFF
#if USE_TOP_RIGHT_FOR_NOISE_DECAY
	envFollowNoise.decayCoeff(&envFollowNoise,adc1[ADC_values[ControlParameterNoiseDecay]]);
#else
	envFollowNoise.decayCoeff(&envFollowNoise,adc1[ADC_values[ControlParameterDive]]);
#endif
	
	// SET SINE DECAY COEFF
  envFollowSine.decayCoeff(&envFollowSine,adc1[ADC_values[ControlParameterSineDecay]]);

	// UPDATE FEEDBACK 
	newFeedback = interpolateFeedback(ADC_values[ControlParameterFeedback]);
	rampFeedback.setDest(&rampFeedback,newFeedback);
	smoothedParams[SmoothedParameterFeedback] = rampFeedback.tick(&rampFeedback);
	
	// UPDATE SINE FREQ
	sin1.freq(&sin1, rampSineFreq.tick(&rampSineFreq) + (FM_in * 1000.0f));
	
	// UPDATE DELAY PERIOD
	smoothedParams[SmoothedParameterDelay] = rampDelayFreq.tick(&rampDelayFreq);
	//delayfreq = 1.0f/(((FM_in + 1.0f) * 0.5f) * 1000.0f); //trying FM delay period
	delay1.setDelay(&delay1, smoothedParams[SmoothedParameterDelay]);
	
	// MIX

	float sample = 0.8f * audioIn;
	if (ADC_values[ControlParameterFeedback] > 5) {
		sample += (ksGain * ksTick(audioIn));
	}
	if (ADC_values[ControlParameterSineDecay] > 5) {

		sineEnv = envFollowSine.tick(&envFollowSine,audioIn); 
		sample += (sineGain * sin1.tick(&sin1) * sineEnv);
		
	}
	sample *= .1f;
	
#if USE_TOP_RIGHT_FOR_NOISE_DECAY
	if (ADC_values[ControlParameterNoiseDecay] > 5) {

		noiseEnv = envFollowNoise.tick(&envFollowNoise,audioIn); 
		sample += noiseGain * (noiseFilterGain * svf1.tick(&svf1, noise1.tick(&noise1)) * envFollowNoise.tick(&envFollowNoise,audioIn));
	}
#else 
	if (ADC_values[ControlParameterDive] > 5) {

		noiseEnv = envFollowNoise.tick(&envFollowNoise,audioIn); 
		sample += noiseGain * (noiseFilterGain * svf1.tick(&svf1, noise1.tick(&noise1)) * envFollowNoise.tick(&envFollowNoise,audioIn));
	}
#endif
	
	sample *= masterGain;
  sample = highpass1.tick(&highpass1, shaper1[(uint16_t)((sample+1.0f)*0.5f * TWO_TO_15)]);
	
