spiricom/stm32f4/drumbox_405_firstIC/Src/waveplayer.c
	if (++newcount == 4) {
		newcount = 0;
		
		//externalDACOutputBuffer[0] = 0x50;
	
		uint16_t sineEnvToDAC = (uint16_t)(sineEnv * TWO_TO_12);
		externalDACOutputBuffer[0] = (sineEnvToDAC >> 8); 
		externalDACOutputBuffer[1] = (sineEnvToDAC & 255);
	
		uint16_t noiseEnvToDAC = (uint16_t)(noiseEnv * TWO_TO_12);
		externalDACOutputBuffer[2] = (noiseEnvToDAC >> 8); 
		externalDACOutputBuffer[3] = (noiseEnvToDAC & 255); 
	
		externalDACOutputBuffer[4] = ((myTouchpad[0] * 16) >> 8);
		externalDACOutputBuffer[5] = (myTouchpad[0] * 16) & 255;

		externalDACOutputBuffer[6] = ((myTouchpad[1] * 16) >> 8);
		externalDACOutputBuffer[7] = (myTouchpad[1] * 16) & 255;
	
		DMA1_externalDACSend();
	}

#if TRIG_OUT
	
	// TRIGGER
	float peakEnv = envFollowTrigOut.tick(&envFollowTrigOut,audioIn);
	//setTrigOut(peakEnv > 0.05f);
	
	if (sampSinceTrig > NUM_SAMPS_BETWEEN_TRIG) {
		
		if (peakEnv > 0.01f) {
			  setTrigOut(1);
				sampSinceTrig = 0;
		} 	
	} else {
		
		sampSinceTrig++;
	}
	
	if (peakEnv < 0.005f) { 
			setTrigOut(0);
	}
#endif
	

	
	return sample;
}

void DMA1_externalDACSend(void) {
	// Start communication with external DAC
	HAL_I2C_Master_Transmit_DMA(&hi2c1, 192, externalDACOutputBuffer, NUM_BYTES_TO_SEND);

}

void DMA1_externalDACInit(void) {
	// Start communication with external DAC
	//HAL_I2C_Master_Transmit_DMA(&hi2c1, 192, (uint8_t *)&externalDACOutputBufferTX[0], NUM_BYTES_TO_SEND);
	
	//Send a general call to the DAC chip (using i2c address 0 for "general call") that tells it to reset
	HAL_I2C_Master_Transmit_DMA(&hi2c1, 0, I2CReset_buffer, 1);
	HAL_Delay(10);
	//Send initial commands to the CV DAC channels to set their gain and vref stuff correctly
	HAL_I2C_Master_Transmit_DMA(&hi2c1, 192, I2C_init_command, 3);
	I2C_init_command[0] = 0x5A;
	HAL_I2C_Master_Transmit_DMA(&hi2c1, 192, I2C_init_command, 3);
	I2C_init_command[0] = 0x5C;
	HAL_I2C_Master_Transmit_DMA(&hi2c1, 192, I2C_init_command, 3);
	I2C_init_command[0] = 0x5E;
	HAL_I2C_Master_Transmit_DMA(&hi2c1, 192, I2C_init_command, 3);
}

float clip(float min, float val, float max) {
	
	if (val < min) {
		return min;
	} else if (val > max) {
		return max;
	} else {
		return val;
	}
}

float ksTick(float noise_in)
{
		float temp_sample, out, gain;
	  
		temp_sample = noise_in + (feedbacksamp * smoothedParams[SmoothedParameterFeedback]);
		
		//feedbacksamp = delayTick(temp_sample);
		feedbacksamp = delay1.tick(&delay1, temp_sample);
				
	  //simple one-zero lowpass filter (moving average)
		m_output0 = 0.5f * m_input1 + 0.5f * feedbacksamp;
		m_input1 = feedbacksamp;
		feedbacksamp = clip(-1.0f,highpass2.tick(&highpass2,m_output0),1.0f);
		if (feedbacksamp < 0.001f) {
			rampKSGain.setDest(&rampKSGain, 0.0f);
		} 
		if (feedbacksamp > 0.0015f) {
			rampKSGain.setDest(&rampKSGain, 1.0f);
		}
		gain = rampKSGain.tick(&rampKSGain);
		out = gain * shaper1[(uint16_t)(((feedbacksamp + 1.0f) * 0.5f) * (TWO_TO_16-1))];
		return out;
}


void readExternalADC(void)
{
	uint8_t knobnum;
	uint16_t knobval12bit;
	uint16_t knobsendbyte;
	uint8_t ADC_out[2];
	
	knobnum = ADC_in[0] >> 4;
	knobval12bit = (ADC_in[1] | ((ADC_in[0] & 15) << 8));
	ADC_values[knobnum] = knobval12bit;
	
	// write to ADC chip (asking for data on next channel)
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET); // ADC CS pin goes low to initiate conversion

	//create the word to send to the knob ADC chips (telling the ADC which channel to scan this time around)
	knobsendbyte = 6208 + (whichKnob << 7);
	ADC_out[0] = knobsendbyte >> 8;
	ADC_out[1] = knobsendbyte & 255;
	
	hspi1.State = HAL_SPI_STATE_READY;
	
	//for(int j = 0; j < 10; j++);
	
	HAL_SPI_TransmitReceive_DMA(&hspi2, (uint8_t *)ADC_out, (uint8_t *)ADC_in, ADC_BUFFERSIZE);
		
	//for(int j = 0; j < 5000; j++);

/*
	if (knobnum == ControlParameterFeedback){
		
		newFeedback = interpolateFeedback(ADC_values[ControlParameterFeedback]);
		rampFeedback.setDest(&rampFeedback,newFeedback);
	} 
*/
	if (++whichKnob >= NUM_KNOBS)
	{
		whichKnob = 0;
	}
}

float interpolateDelayControl(float raw_data)
{
	float scaled_raw = raw_data * INV_TWO_TO_12;
	if (scaled_raw < 0.4f)
	{
		return (DelayLookup[0] + ((DelayLookup[1] - DelayLookup[0]) * (scaled_raw * 2.5f)));
	}
	else if (scaled_raw < 0.8f)
	{
		return (DelayLookup[1] + ((DelayLookup[2] - DelayLookup[1]) * ((scaled_raw - 0.4f) * 2.5f)));
	}
	else
	{
		return (DelayLookup[2] + ((DelayLookup[3] - DelayLookup[2]) * ((scaled_raw - 0.8f) * 5.0f)));
	}	
}
float out;
uint16_t index1;
float delPer;
float w1,w2,range;
float interpolateFeedback(uint16_t idx) {
	
	index1 = idx;
	float delayPeriod = (smoothedParams[SmoothedParameterDelay] * INV_SAMPLE_RATE);
	delPer = delayPeriod;
	
	
	if (delayPeriod < feedbackDelayPeriod[0]) {
			out = FB1[idx];
	} else if (delayPeriod < feedbackDelayPeriod[1]) {
			// interp between fb[i] and fb[i-1]
			range = feedbackDelayPeriod[1] - feedbackDelayPeriod[0]; 
			w1 = (feedbackDelayPeriod[1] - delayPeriod)/range;
			w2 = 1.0f - w1; 

			out = (FB1[idx] * w1) + (FB2[idx] * w2); 	
	} else if (delayPeriod < feedbackDelayPeriod[2]) {
		
			range = feedbackDelayPeriod[2] - feedbackDelayPeriod[1]; 
			w1 = (feedbackDelayPeriod[2] - delayPeriod)/range;
			w2 = 1.0f - w1; 

			out = (FB2[idx] * w1) + (FB3[idx] * w2); 	
	} else if (delayPeriod < feedbackDelayPeriod[3]) {
		
			range = feedbackDelayPeriod[3] - feedbackDelayPeriod[2]; 
			w1 = (feedbackDelayPeriod[3] - delayPeriod)/range;
			w2 = 1.0f - w1; 

			out = (FB3[idx] * w1) + (FB4[idx] * w2);
	} else if (delayPeriod < feedbackDelayPeriod[4]) {
		
			range = feedbackDelayPeriod[4] - feedbackDelayPeriod[3]; 
			w1 = (feedbackDelayPeriod[4] - delayPeriod)/range;
			w2 = 1.0f - w1; 

			out = (FB4[idx] * w1) + (FB5[idx] * w2);
	} else if (delayPeriod < feedbackDelayPeriod[5]) {
		
			range = feedbackDelayPeriod[5] - feedbackDelayPeriod[4]; 
			w1 = (feedbackDelayPeriod[5] - delayPeriod)/range;
			w2 = 1.0f - w1; 

			out = (FB5[idx] * w1) + (FB6[idx] * w2);
	} else if (delayPeriod < feedbackDelayPeriod[6]) {
		
			range = feedbackDelayPeriod[6] - feedbackDelayPeriod[5]; 
			w1 = (feedbackDelayPeriod[6] - delayPeriod)/range;
			w2 = 1.0f - w1; 

			out = (FB6[idx] * w1) + (FB7[idx] * w2);
	} else if (delayPeriod < feedbackDelayPeriod[7]) {
		
			range = feedbackDelayPeriod[7] - feedbackDelayPeriod[6]; 
			w1 = (feedbackDelayPeriod[7] - delayPeriod)/range;
			w2 = 1.0f - w1; 

			out = (FB7[idx] * w1) + (FB8[idx] * w2);
	}else  {
			out = FB8[idx] ;
	} 
	
	return out;
	

